In [2]:
print('Hello world')

Hello world

In [3]:
import pandas as pd
df = pd.read_csv('data.csv',nrows = 5,index_col = 'sn')
df

       name  age        add        phone
sn
1     Akash   34  Kathmandu   9867667654
2     Nabin   67  Bhaktapur   9867667543
3   Basanta   78      Patan    988778765
4       Ram   89       Bara   9878778765
5     Sabin   56  Kathnabdu  98098778765

In [4]:
try:
    file = open('data.csv','x')
    file.close()
except:
    print("The file is already there ! ")

The file is already there !

In [5]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   sn     name  age        add        phone
0   1    Akash   34  Kathmandu   9867667654
1   2    Nabin   67  Bhaktapur   9867667543
2   3  Basanta   78      Patan    988778765
3   4      Ram   89       Bara   9878778765
4   5    Sabin   56  Kathnabdu  98098778765
5   6   Ramesh   67      Patan   9845445432

In [6]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   sn     name  age        add        phone
0   1    Akash   34  Kathmandu   9867667654
1   2    Nabin   67  Bhaktapur   9867667543
2   3  Basanta   78      Patan    988778765
3   4      Ram   89       Bara   9878778765
4   5    Sabin   56  Kathnabdu  98098778765
5   6   Ramesh   67      Patan   9845445432

In [7]:
df[df['add'] == 'Bara']

   sn name  age   add       phone
3   4  Ram   89  Bara  9878778765

In [8]:
df['phone']

0     9867667654
1     9867667543
2      988778765
3     9878778765
4    98098778765
5     9845445432
Name: phone, dtype: int64

In [10]:
data = df[df['age'] >70]
data
data.to_csv('new_data.csv')